/* 
  Localizable.strings (English)
  NextFrameX
*/

/* Menu Items */
"menu.settings" = "Settings";
"menu.language" = "Language";
"menu.language.system" = "Follow System";
"menu.language.english" = "English";
"menu.language.chinese" = "简体中文";
"menu.processing.preferences" = "Processing Preferences…";
"menu.performance.mode" = "Performance Mode";
"menu.iap.toggle" = "IAP Purchase";
"menu.clear.cache" = "Clear Cache";
"menu.terms" = "Terms of Service";
"menu.privacy" = "Privacy Policy";

/* Common */
"common.ok" = "OK";
"common.cancel" = "Cancel";
"common.confirm" = "Confirm";
"common.delete" = "Delete";
"common.save" = "Save";
"common.load" = "Load";
"common.export" = "Export";
"common.import" = "Import";

/* Alerts */
"alert.language.changed" = "Language Changed";
"alert.language.changed.message" = "The language has been changed. Please restart the app for the changes to take full effect.";

/* Settings */
"settings.title" = "Settings";
"settings.language" = "Language";
"settings.language.description" = "Select the application language";

/* Performance Mode */
"performance.mode.enabled" = "Performance Mode Enabled";
"performance.mode.disabled" = "Performance Mode Disabled";
"performance.mode.enabled.message" = "Preview resolution has been reduced to 2048px to improve processing performance.\n\nThis will take effect the next time you load an image.";
"performance.mode.disabled.message" = "Preview resolution has been restored to 4096px.\n\nThis will take effect the next time you load an image.";

/* Purchase Mode */
"purchase.mode.changed" = "Purchase Mode Changed";
"purchase.mode.iap.message" = "Switched to IAP purchase mode.\n\nClick the purchase status bar to open the Apple purchase dialog.";
"purchase.mode.activation.message" = "Switched to activation code mode.\n\nClick the purchase status bar to open the activation code input dialog.";

/* Cache */
"cache.clear.title" = "Clear Cache";
"cache.clear.message" = "This will clear historical image parameters, which will be recalculated on the next import.\n\nEstimated cache size: %@\n\nPlease select the time range to clear:";
"cache.clear.today" = "Today";
"cache.clear.week" = "Last Week";
"cache.clear.month" = "Last Month";
"cache.clear.all" = "All";
"cache.cleared" = "Cache Cleared";
"cache.cleared.message" = "Cache has been successfully cleared.";

/* IAP Purchase */
"iap.purchase.title" = "Purchase Plan";
"iap.subscription.title" = "Subscription Plans";
"iap.subscription.description" = "Unlimited exports during subscription period. Subscription will auto-renew unless cancelled in App Store settings.";
"iap.no.products" = "No available plans";
"iap.reload" = "Reload";
"iap.purchase.button" = "Purchase";
"iap.subscription.period" = "Subscription Period: %@";
"iap.subscription.unlimited" = "Unlimited exports during subscription period";
"iap.subscription.per.period" = "Per %@";
"iap.subscription.period.day" = "%d day(s)";
"iap.subscription.period.week" = "%d week(s)";
"iap.subscription.period.month" = "%d month(s)";
"iap.subscription.period.year" = "%d year(s)";
"iap.subscription.period.cycle" = "%d cycle(s)";

/* Toolbar */
"toolbar.rotate.counterclockwise" = "Rotate 90° counterclockwise";
"toolbar.rotate.counterclockwise.mirrored" = "Rotate 90° clockwise (mirror enabled)";
"toolbar.rotate.clockwise" = "Rotate 90° clockwise";
"toolbar.rotate.clockwise.mirrored" = "Rotate 90° counterclockwise (mirror enabled)";
"toolbar.mirror.horizontal" = "Horizontal mirror (flip left-right)";
"toolbar.crop.cancel" = "Cancel";
"toolbar.crop.auto" = "Auto Crop";
"toolbar.crop.auto.help" = "Set smart range boundaries as crop frame";
"toolbar.crop.reset" = "Reset";
"toolbar.crop.confirm" = "Done";
"toolbar.crop.mode" = "Crop Mode";
"toolbar.crop" = "Crop";
"toolbar.export" = "Export";
"thumbnail.list.export" = "Export";
"thumbnail.list.export.batch" = "Batch Export";

/* Thumbnail List */
"thumbnail.list.title" = "Image List";
"thumbnail.list.selected" = "Selected %d";
"thumbnail.list.importing" = "Importing: %d/%d";
"thumbnail.list.remove" = "Remove";
"thumbnail.list.load.failed" = "Load Failed";
"thumbnail.list.import" = "Import";
"thumbnail.list.environment.switched" = "Switched to: %@\n\nTip: Long press the import button for 3 seconds to switch environment";
"environment.switched.title" = "Environment Switched";

/* Adjustment Panel */
"adjustment.panel.title" = "Adjustment Panel";
"adjustment.panel.auto" = "Auto";
"adjustment.panel.reset" = "Reset";
"adjustment.panel.processing" = "Processing...";
"adjustment.panel.smart.range" = "Smart Range";
"adjustment.panel.detecting" = "Detecting";
"adjustment.panel.manual.selection" = "Manual Selection";
"adjustment.panel.invert" = "Invert";
"adjustment.panel.color.cast.removal" = "Color Cast Removal";
"adjustment.panel.style.boost" = "Style Boost";
"adjustment.panel.auto.adjust" = "Auto Adjust";
"adjustment.panel.color" = "Color";
"adjustment.panel.contrast" = "Contrast";
"adjustment.panel.min.value" = "Min Value:";
"adjustment.panel.max.value" = "Max Value:";
"adjustment.panel.temperature.tint" = "Temperature & Tint";
"adjustment.panel.auto.detect" = "Auto Detect";
"adjustment.panel.temperature" = "Temp";
"adjustment.panel.tint" = "Tint";
"adjustment.panel.reset.whitebalance.help" = "Reset white balance";
"adjustment.panel.basic.adjustment" = "Basic Adjustment";
"adjustment.panel.exposure" = "Exp";
"adjustment.panel.shadows" = "Shad";
"adjustment.panel.highlights" = "High";
"adjustment.panel.reset.basic.help" = "Reset all basic adjustments";

/* Histogram */
"histogram.range" = "Range";
"histogram.average" = "Average";
"histogram.peak" = "Peak";
"histogram.soft" = "Soft";
"histogram.balanced" = "Balanced";
"histogram.strong" = "Strong";
"histogram.channel.red" = "Red";
"histogram.channel.green" = "Green";
"histogram.channel.blue" = "Blue";
"histogram.channel.rgb" = "RGB";
"histogram.channel.stats" = "%@ Channel Statistics";
"histogram.levels.black" = "B";
"histogram.levels.mid" = "Mid";
"histogram.levels.white" = "W";
"histogram.reset.channel.help" = "Reset current channel";
"histogram.color.cast.toggle" = "Color Cast";
"histogram.color.cast.help" = "Enable color cast correction";
"histogram.brightness.toggle" = "Brightness";
"histogram.brightness.help" = "Enable brightness fix";
"whitebalance.region.shadows" = "Shadows";
"whitebalance.region.midtones" = "Midtones";
"whitebalance.region.highlights" = "Highlights";
"whitebalance.region.overall" = "Overall";

/* Image Preview */
"preview.raw.suggestion" = "Suggestion: Use Adobe DNG Converter to convert RAW files to DNG format for better compatibility";
"preview.hint.select.border" = "Press A to select the area within the film border to remove color cast";
"preview.hint.adjust.range" = "Press < > to quickly adjust the detection range";
"preview.hint.adjust.style" = "Press [ ] to adjust the color cast removal style";
"preview.hint.auto.whitebalance" = "Press W for auto white balance";
"preview.hint.auto.adjust" = "Press S to auto adjust contrast and color";
"preview.hint.crop.mode" = "Press F to enter crop mode";
"preview.hint.auto.crop" = "Press D to auto crop the detection range";
"preview.hint.preserve.effect" = "Press R to see the effect of preserving color cast/brightness";
"preview.hint.copy.params" = "Copy parameters: Command+C, Paste: Command+V";
"preview.hint.rotate" = "Arrow keys ← → to rotate photo";
"preview.hint.remove.image" = "Press X to remove image";
"preview.hint.raw.to.dng" = "Unsupported RAW files can be converted to DNG and then imported";
"preview.hint.wish" = "Deal with your film faster and easier";

/* Menu - Account & Update */
"menu.account" = "Account";
"menu.update" = "Update";
"menu.update.check" = "Check for Updates";

/* Purchase Status */
"purchase.status.not.activated" = "Not Activated";
"purchase.status.remaining.exports" = "Remaining %d exports";
"purchase.status.remaining.days.unlimited" = "Remaining %d days unlimited";
"purchase.status.remaining.days.and.exports" = "Remaining %d days unlimited + %d exports";

/* Alerts - Export */
"alert.login.required" = "Login Required";
"alert.login.required.message" = "Activation code mode requires login to deduct credits. Please login first before exporting.";
"alert.login.go" = "Go to Login";
"alert.export.format.title" = "Select Export Format";
"alert.export.format.message" = "Please select the image format to export";
"alert.export.format.tiff" = "TIFF";
"alert.export.format.jpg" = "JPG";
"alert.remove.confirm.title" = "Confirm Removal";
"alert.remove.confirm.multiple" = "Are you sure you want to remove %d selected images?";
"alert.remove.confirm.single" = "Are you sure you want to remove image \"%@\"?";
"alert.remove.button" = "Remove";

/* Account Login */
"account.login.title" = "Login";
"account.register.title" = "Register";
"account.login.description" = "Please login to your account to use activation code features";
"account.register.description" = "Please register a new account to use activation code features";
"account.login.switch.to.register" = "No account? Register";
"account.register.switch.to.login" = "Have an account? Login";
"account.email" = "Email";
"account.email.placeholder" = "Enter email";
"account.password" = "Password";
"account.password.placeholder" = "Enter password (at least 6 characters)";
"account.confirm.password" = "Confirm Password";
"account.confirm.password.placeholder" = "Enter password again";
"account.login.button" = "Login";
"account.register.button" = "Register";
"account.error.email.password.required" = "Please enter email and password";
"account.error.confirm.password.required" = "Please confirm password";
"account.error.invalid.email" = "Invalid email format";
"account.error.password.too.short" = "Password must be at least 6 characters";
"account.error.password.mismatch" = "Passwords do not match";

/* Account Detail */
"account.detail.title" = "Account Details";
"account.detail.username" = "Username:";
"account.detail.remaining.exports" = "Remaining Exports:";
"account.detail.used.exports" = "Used Exports:";
"account.detail.total.exports" = "Total Exports:";
"account.detail.remaining.days" = "Remaining Valid Days:";
"account.detail.days" = "days";
"account.detail.recover.legacy.title" = "Recover Legacy Credits";
"account.detail.recover.legacy.description" = "Recover historical recharge credits from legacy fingerprint file and bind to current account and device.";
"account.detail.recover.button" = "Recover Credits";
"account.detail.recover.error.not.logged.in" = "Please login first before recovering credits";
"account.detail.recover.error.no.fingerprint" = "Legacy fingerprint file not found, cannot recover";
"account.detail.recover.error.failed" = "Recovery failed, please try again later";
"account.detail.recover.success.remaining" = "Remaining credits: %@";
"account.detail.recover.success.synced" = "Synced %d activation codes";
"account.detail.devices.title" = "Activated Devices";
"account.detail.devices.empty" = "No activated devices";
"account.detail.devices.current" = "(Current Device)";
"account.detail.devices.last.used" = "Last used: %@";
"account.detail.devices.hint" = "Tip: Account can be used on up to %d devices";
"account.detail.close" = "Close";
"account.detail.logout" = "Logout";

/* Version Update */
"version.update.title" = "New Version Available";
"version.update.current" = "Current Version: %@";
"version.update.latest" = "Latest Version: %@";
"version.update.message" = "Please update to the latest version for a better experience";
"version.update.later" = "Later";
"version.update.now" = "Update Now";

/* Processing Preferences */
"processing.preferences.title" = "Processing Preferences";
"processing.preferences.auto.color.cast" = "Auto Color Cast Correction";
"processing.preferences.auto.brightness" = "Auto Brightness Fix";
"processing.preferences.smart.range.default" = "Smart Range Default:";
"processing.preferences.raw.images" = "RAW Images";
"processing.preferences.tiff.other.images" = "TIFF / Other Images";
"processing.preferences.default.color.intensity" = "Default Color Intensity:";
"processing.preferences.default.contrast" = "Default Contrast:";
"processing.preferences.info.message" = "Changes will affect the default state when loading or resetting images next time.";
"processing.preferences.smart.range.disabled" = "Disabled";
"processing.preferences.smart.range.smart" = "Smart";

/* Export Progress */
"export.progress.title" = "Exporting Images";
"export.progress.progress" = "Progress:";
"export.progress.cancel" = "Cancel";